[
    {
        "word": "Accommodate",
        "definition": "To provide with a place to live or to be stored in."
    },
    {
        "word": "Bureaucracy",
        "definition": "A system of government in which most of the important decisions are made by state officials rather than by elected representatives."
    },
    {
        "word": "Conscientious",
        "definition": "Wishing to do one's work or duty well and thoroughly."
    },
    {
        "word": "Definitely",
        "definition": "Without doubt (used for emphasis)."
    },
    {
        "word": "Exhilarate",
        "definition": "Make (someone) feel very happy, animated, or elated."
    },
    {
        "word": "Foreign",
        "definition": "Of, from, in, or characteristic of a country or language other than one's own."
    },
    {
        "word": "Gauge",
        "definition": "An instrument or device for measuring the magnitude, amount, or contents of something."
    },
    {
        "word": "Hierarchy",
        "definition": "A system or organization in which people or groups are ranked one above the other according to status or authority."
    },
    {
        "word": "Indispensable",
        "definition": "Absolutely necessary."
    },
    {
        "word": "Knowledgeable",
        "definition": "Intelligent and well informed."
    },
    {
        "word": "Liaison",
        "definition": "Communication or cooperation which facilitates a close working relationship between people or organizations."
    },
    {
        "word": "Millennium",
        "definition": "A period of a thousand years, especially when calculated from the traditional date of the birth of Christ."
    },
    {
        "word": "Necessary",
        "definition": "Required to be done, achieved, or present; needed; essential."
    },
    {
        "word": "Occasionally",
        "definition": "At infrequent or irregular intervals; now and then."
    },
    {
        "word": "Pronunciation",
        "definition": "The way in which a word is pronounced."
    },
    {
        "word": "Questionnaire",
        "definition": "A set of printed or written questions with a choice of answers, devised for the purposes of a survey or statistical study."
    },
    {
        "word": "Rhythm",
        "definition": "A strong, regular, repeated pattern of movement or sound."
    },
    {
        "word": "Schedule",
        "definition": "A plan for carrying out a process or procedure, giving lists of intended events and times."
    },
    {
        "word": "Threshold",
        "definition": "The magnitude or intensity that must be exceeded for a certain reaction, phenomenon, result, or condition to occur or be manifested."
    },
    {
        "word": "Unanimous",
        "definition": "(of two or more people) fully in agreement."
    },
    {
        "word": "Vacuum",
        "definition": "A space entirely devoid of matter."
    },
    {
        "word": "Weird",
        "definition": "Suggesting something supernatural; uncanny."
    },
    {
        "word": "Xylophone",
        "definition": "A musical instrument played by striking a row of wooden bars of graduated length with one or more small wooden or plastic beaters."
    },
    {
        "word": "Yacht",
        "definition": "A medium-sized sailboat equipped for cruising or racing."
    },
    {
        "word": "Miscellaneous",
        "definition": "Consisting of a mixture of various things that are not usually connected with each other."
    }
]